{"class_name": "Model", "config": {"name": "model_5", "layers": [{"name": "images", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 14, 14, 512], "dtype": "float32", "sparse": false, "name": "images"}, "inbound_nodes": []}, {"name": "max_pooling2d_5", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["images", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_11", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"name": "conv2d_17", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"name": "conv2d_18", "class_name": "Conv2D", "config": {"name": "conv2d_18", "trainable": true, "filters": 256, "kernel_size": [2, 2], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"name": "conv2d_19", "class_name": "Conv2D", "config": {"name": "conv2d_19", "trainable": true, "filters": 256, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"name": "conv2d_20", "class_name": "Conv2D", "config": {"name": "conv2d_20", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"name": "lambda_17", "class_name": "Lambda", "config": {"name": "lambda_17", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0006\u0000\u0000\u0000C\u0000\u0000\u0000s \u0000\u0000\u0000|\u0000d\u0000d\u0000\u0085\u0002d\u0001d\u0002\u0085\u0002d\u0001d\u0002\u0085\u0002d\u0000d\u0000\u0085\u0002f\u0004\u0019\u0000S\u0000)\u0003N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0003\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u001f<ipython-input-45-9f43db63561f>\u00da\b<lambda>\u0010\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape": [3, 3, 128], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"name": "input1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 100], "dtype": "float32", "sparse": false, "name": "input1"}, "inbound_nodes": []}, {"name": "lambda_18", "class_name": "Lambda", "config": {"name": "lambda_18", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0006\u0000\u0000\u0000C\u0000\u0000\u0000s \u0000\u0000\u0000|\u0000d\u0000d\u0000\u0085\u0002d\u0001d\u0002\u0085\u0002d\u0002d\u0003\u0085\u0002d\u0000d\u0000\u0085\u0002f\u0004\u0019\u0000S\u0000)\u0004N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0003\u0000\u0000\u0000\u00e9\u0006\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0004\u0000\u0000\u0000r\u0004\u0000\u0000\u0000\u00fa\u001f<ipython-input-45-9f43db63561f>\u00da\b<lambda>\u0011\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape": [3, 3, 128], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"name": "lambda_19", "class_name": "Lambda", "config": {"name": "lambda_19", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0006\u0000\u0000\u0000C\u0000\u0000\u0000s \u0000\u0000\u0000|\u0000d\u0000d\u0000\u0085\u0002d\u0001d\u0002\u0085\u0002d\u0003d\u0001\u0085\u0002d\u0000d\u0000\u0085\u0002f\u0004\u0019\u0000S\u0000)\u0004N\u00e9\u0003\u0000\u0000\u0000\u00e9\u0006\u0000\u0000\u0000\u00e9\u0000\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0004\u0000\u0000\u0000r\u0004\u0000\u0000\u0000\u00fa\u001f<ipython-input-45-9f43db63561f>\u00da\b<lambda>\u0012\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape": [3, 3, 128], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"name": "lambda_20", "class_name": "Lambda", "config": {"name": "lambda_20", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0006\u0000\u0000\u0000C\u0000\u0000\u0000s \u0000\u0000\u0000|\u0000d\u0000d\u0000\u0085\u0002d\u0001d\u0002\u0085\u0002d\u0001d\u0002\u0085\u0002d\u0000d\u0000\u0085\u0002f\u0004\u0019\u0000S\u0000)\u0003N\u00e9\u0003\u0000\u0000\u0000\u00e9\u0006\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u001f<ipython-input-45-9f43db63561f>\u00da\b<lambda>\u0013\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape": [3, 3, 128], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"name": "flatten_17", "class_name": "Flatten", "config": {"name": "flatten_17", "trainable": true}, "inbound_nodes": [[["lambda_17", 0, 0, {}]]]}, {"name": "bidirectional_1", "class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}}, "merge_mode": "ave"}, "inbound_nodes": [[["input1", 0, 0, {}]]]}, {"name": "flatten_18", "class_name": "Flatten", "config": {"name": "flatten_18", "trainable": true}, "inbound_nodes": [[["lambda_18", 0, 0, {}]]]}, {"name": "flatten_19", "class_name": "Flatten", "config": {"name": "flatten_19", "trainable": true}, "inbound_nodes": [[["lambda_19", 0, 0, {}]]]}, {"name": "flatten_20", "class_name": "Flatten", "config": {"name": "flatten_20", "trainable": true}, "inbound_nodes": [[["lambda_20", 0, 0, {}]]]}, {"name": "concatenate_21", "class_name": "Concatenate", "config": {"name": "concatenate_21", "trainable": true, "axis": 1}, "inbound_nodes": [[["flatten_17", 0, 0, {}], ["bidirectional_1", 0, 0, {}]]]}, {"name": "concatenate_22", "class_name": "Concatenate", "config": {"name": "concatenate_22", "trainable": true, "axis": 1}, "inbound_nodes": [[["flatten_18", 0, 0, {}], ["bidirectional_1", 0, 0, {}]]]}, {"name": "concatenate_23", "class_name": "Concatenate", "config": {"name": "concatenate_23", "trainable": true, "axis": 1}, "inbound_nodes": [[["flatten_19", 0, 0, {}], ["bidirectional_1", 0, 0, {}]]]}, {"name": "concatenate_24", "class_name": "Concatenate", "config": {"name": "concatenate_24", "trainable": true, "axis": 1}, "inbound_nodes": [[["flatten_20", 0, 0, {}], ["bidirectional_1", 0, 0, {}]]]}, {"name": "reshape_17", "class_name": "Reshape", "config": {"name": "reshape_17", "trainable": true, "target_shape": [1, 1280]}, "inbound_nodes": [[["concatenate_21", 0, 0, {}]]]}, {"name": "reshape_18", "class_name": "Reshape", "config": {"name": "reshape_18", "trainable": true, "target_shape": [1, 1280]}, "inbound_nodes": [[["concatenate_22", 0, 0, {}]]]}, {"name": "reshape_19", "class_name": "Reshape", "config": {"name": "reshape_19", "trainable": true, "target_shape": [1, 1280]}, "inbound_nodes": [[["concatenate_23", 0, 0, {}]]]}, {"name": "reshape_20", "class_name": "Reshape", "config": {"name": "reshape_20", "trainable": true, "target_shape": [1, 1280]}, "inbound_nodes": [[["concatenate_24", 0, 0, {}]]]}, {"name": "concatenate_25", "class_name": "Concatenate", "config": {"name": "concatenate_25", "trainable": true, "axis": 1}, "inbound_nodes": [[["reshape_17", 0, 0, {}], ["reshape_18", 0, 0, {}], ["reshape_19", 0, 0, {}], ["reshape_20", 0, 0, {}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_12", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_25", 0, 0, {}]]]}, {"name": "lstm_9", "class_name": "LSTM", "config": {"name": "lstm_9", "trainable": true, "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "units": 512, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_13", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["lstm_9", 0, 1, {}]]]}, {"name": "repeat_vector_5", "class_name": "RepeatVector", "config": {"name": "repeat_vector_5", "trainable": true, "n": 12}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"name": "lstm_10", "class_name": "LSTM", "config": {"name": "lstm_10", "trainable": true, "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["repeat_vector_5", 0, 0, {}]]]}, {"name": "time_distributed_5", "class_name": "TimeDistributed", "config": {"name": "time_distributed_5", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "units": 442, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["lstm_10", 0, 0, {}]]]}], "input_layers": [["images", 0, 0], ["input1", 0, 0]], "output_layers": [["time_distributed_5", 0, 0]]}, "keras_version": "2.0.6", "backend": "tensorflow"}